In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

top 3 rows

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

last 3 rows

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

finding shape of the dataset

In [6]:
df1.shape

(7, 3)

In [7]:
print("no.of rows",df1.shape[0])
print("no.of colm",df1.shape[1])

no.of rows 7
no.of colm 3

4. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

check null vales in dataset

In [10]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

get overall statistics about thee dataframe

In [11]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [12]:
df1.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

find unique valuses in gender coloumn

In [13]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [15]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

Find the Number of Unique values from the Gender column

In [16]:
df1["Gender"].nunique()

2

Display Count of Unique Values In Gender Column

In [17]:
df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

Find Total Number of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [19]:
df1[df1["Marks"]>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [21]:
df1[(df1["Marks"]>=90)  &  (df1["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [22]:
sum((df1['Marks']>=90) & (df1['Marks']<=100))

4

In [23]:
sum(df1['Marks'].between(90,100))

4

find average marks

In [24]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [25]:
df1["Marks"].mean()

np.float64(92.14285714285714)

In [26]:
df1["Marks"].min()

np.int64(83)

In [27]:
df1["Marks"].max()

np.int64(99)

apply method

In [33]:
def marks(x):
    return x//2

In [30]:
df1["Marks"].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [35]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [36]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [37]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [39]:
df1["Name"].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

Map function

In [40]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [44]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [42]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [43]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

Drop the coloumns

In [45]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [53]:
df1.drop(['Male_Female','Half_Marks'],axis=1,inplace=True)

KeyError: "['Male_Female', 'Half_Marks'] not found in axis"

print name of coloumns

In [49]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

In [52]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [54]:
df1.index

RangeIndex(start=0, stop=7, step=1)

Sort The Dataframe As Per The Marks Column

In [55]:
df1.sort_values(by="Marks")

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [56]:
df1.sort_values(by="Marks",ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [57]:
df1.sort_values(by=["Marks", "Gender"],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

Display Name & Marks of The Female Students

In [58]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [59]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99